---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMoveByConnector
source: html/7575a7d3-9147-2d86-b380-c5d983eda12b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMoveByConnector Property

Cannot move analytical surface because it will disconnect the analytical nodes.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalSurfaceCannotMoveByConnector { get; }
```